Soap/operation/CARD_PAYMENT/CARD_PAYMENT_Samples/import_CARD_PAYMENT_Mandatory.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AMLYZE_OPERATION xmlns="urn:amlyze-services:EvaluateOperationService_v2r0">
            <CommunicationNumber>ComNr_0074</CommunicationNumber>
            <Requester>financial_institution</Requester>
            <OperationExtId>Op_0074</OperationExtId>
            <OperationType>CARD_PAYMENT</OperationType>
            <CardOperationSubType>CARD_PURCHASE</CardOperationSubType>
            <RiskManagementCategory>OP_DEFAULT</RiskManagementCategory>
            <SourceOfRiskLevel>IMPORT</SourceOfRiskLevel>
            <OperationStatus>EXECUTED</OperationStatus>
            <RiskLevel>HIGH</RiskLevel>
            <OperationDateTime>2023-09-23T15:09:33+02:00</OperationDateTime>
            <Currency>EUR</Currency>
            <Amount>2000</Amount>
            <FinancialFlowDirection>OUTGOING</FinancialFlowDirection>
            <Description>invoice '11142'</Description>
            <ListOperationParty>
                <OperationParty>
                    <PartyRole>DEBTOR</PartyRole>
                    <AccountNumber>LT933520036948858623</AccountNumber>
                    <BIC>BICXX22</BIC>
                    <EntityType>INDIVIDUAL</EntityType>
                    <FirstName>Geli</FirstName>
                    <LastName>Deliono</LastName>
                </OperationParty>
                <OperationParty>
                    <PartyRole>CREDITOR</PartyRole>
                    <AccountNumber>LT5630800200000745112</AccountNumber>
                    <EntityType>ORGANIZATION</EntityType>
                    <Title>Komele</Title>
                </OperationParty>
            </ListOperationParty>
        </AMLYZE_OPERATION>
    </soap:Body>
</soap:Envelope>
